Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
/**
 * Product: XIAO 1.47 inch Touch Display (JD9853A 172x320 + AXS5106L touch)
 * Display: JD9853A 172x320, BGR, capacitive touch
 * Target:  XIAO ESP32-S3 Plus (RST=13, BL=12). For nRF52840 Plus use the sibling
 *          nRF52840 Plus folder (RST=38, BL=37).
 * Wiring:  CS=D2, DC=D3, MOSI=D10, SCLK=D8; RST=13, BL=12.
 *          Touch SDA=D4, SCL=D5, INT=D7 (I2C 0x63, RST shared with LCD).
 * Demo:    1.47 ESP32-S3 factory dashboard: live SD/touch/IMU/mic/buttons rows + VU meter;
 *          SD probed in a background FreeRTOS task.
 *
 * Ported from XIAO-Display-Board-main (0519_DashBoard_147_ESP32.ino, Arduino_GFX). The
 * Seeed_GFX Board/Config templates replace the original Arduino_SWSPI bus +
 * Arduino_ST7789 panel, the manual MADCTL 0x48 fix, and the BSP
 * esp_lcd_touch_axs5106l driver. Touch is now driven by Touch_AXS5106L +
 * display.attachTouch()/display.getTouch(); the raw-I2C touch decoders and the
 * bsp_touch_init/bsp_touch_read calls were dropped. Because Seeed_GFX drives the
 * LCD over the shared hardware SPI host (Bus_SPI), the obsolete software-SPI
 * recovery (restoreLcdSwSpiPins) is a no-op and SD.end() no longer calls SPI.end()
 * (that would tear down the host the LCD reuses). The g_lcdBusy/g_sdProbeBusy
 * serialization + CS management that actually arbitrates the shared bus is kept.
 */

#include <Arduino.h>
#include <Seeed_GFX.h>
#include "board/boards/XIAO_LCD_Board.h"
#include "driver/tft/Driver_JD9853A.h"
#include "panel/Panel_TFT.h"
#include "touch/Touch_AXS5106L.h"

#include <Wire.h>
#include <SPI.h>
#include <SD.h>
#include <WiFi.h>
#include "esp_idf_version.h"

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

#include <driver/gpio.h>
#include <math.h>
#include <stdarg.h>
#include <esp_log.h>

Seeed_GFX display;

#if defined(ESP32)
// SD shares the LCD's HSPI host (SPI3) with CS arbitration (LCD_CS=D2 / SD_CS=D6).
// The LCD's Bus_SPI uses its own SPIClass(HSPI); this is a second SPIClass on the
// same host (spiStartBus returns a per-host singleton; beginTransaction serializes
// via the bus lock) so the SD does NOT use the default SPI (FSPI/SPI2), which would
// fight the LCD's HSPI for the shared D8/D10 GPIO mux (rectify #74).
SPIClass sdSpi(HSPI);
#endif

static constexpr int8_t LCD_RST_PIN = 13;  // XIAO ESP32-S3 Plus
static constexpr int8_t LCD_BL_PIN  = 12;

// This dashboard shares D8/D10 with the microSD socket and probes the card in
// the background. Keep HSPI, but use a rate with adequate signal margin instead
// of the generic 50 MHz XIAO LCD rate.
struct Config_DashBoard_147_ESP32_Board {
  static const char *name() { return "XIAO 1.47 inch Touch Display (Dashboard)"; }
  static BoardPinConfig pins() {
    return Config_XIAO_1inch47_Touch_LCD_Board<LCD_RST_PIN, LCD_BL_PIN>::pins();
  }
  static SpiBusConfig spi() {
    SpiBusConfig config = xiaoLcdSpiConfig();
    config.writeFrequency = 20000000;
    return config;
  }
};
using Board_DashBoard_147_ESP32 =
    ConfiguredSpiBoard<Config_DashBoard_147_ESP32_Board>;

// The shared reset has already been handled by the display board.
Touch_AXS5106L touch(-1, D7, Wire, 172, 320);

// ========================= Build switches =========================

#define REDUCE_PDM_CLK_DRIVE 1

// Critical for the live dynamic dashboard:
// SD and LCD share D8/D10. SD.begin()/SD.open() can reconfigure or hold those pins.
// SD is probed once in a background task, then SD.end() is called immediately.
// No automatic SD file write is done at boot.
#define SD_PROBE_ONLY_MODE 1
#define SD_BUTTON_WRITE_TEST 0
#define g_sdBusy g_sdProbeBusy

// ========================= Timing =========================

static constexpr uint32_t UI_TEXT_FAST_MS   = 130;
static constexpr uint32_t UI_TEXT_SLOW_MS   = 280;
static constexpr uint32_t UI_VU_MS          = 90;
static constexpr uint32_t UI_MIC_TEXT_MS    = 420;
static constexpr uint32_t SERIAL_MS         = 450;
static constexpr uint32_t SD_REFRESH_MS     = 900;    // async SD probe request interval
static constexpr uint32_t MIC_DECAY_MS      = 80;
static constexpr uint32_t FOOTER_MS         = 500;

// ========================= MIC config =========================

static constexpr int MIC_SAMPLE_RATE_HZ = 16000;
static constexpr bool MIC_CLK_INVERT = false;

// This is only display scaling, not recording gain.
static constexpr float MIC_DISPLAY_SCALE = 2200.0f;
static constexpr size_t MIC_SAMPLES_PER_READ = 256;

// ========================= Pins =========================

static constexpr uint8_t MIC_CLK_PIN   = D0;
static constexpr uint8_t MIC_DATA_PIN  = D1;
static constexpr uint8_t LCD_CS_PIN    = D2;
static constexpr uint8_t LCD_DC_PIN    = D3;
static constexpr uint8_t I2C_SDA_PIN   = D4;
static constexpr uint8_t I2C_SCL_PIN   = D5;
static constexpr uint8_t SD_CS_PIN     = D6;
static constexpr uint8_t TOUCH_INT_PIN = D7;
static constexpr uint8_t LCD_SCK_PIN   = D8;
static constexpr uint8_t SD_MISO_PIN   = D9;
static constexpr uint8_t LCD_MOSI_PIN  = D10;
static constexpr uint8_t IMU_INT_PIN   = D14;
static constexpr uint8_t BTN_B_PIN     = D15;
static constexpr uint8_t BAT_ADC_PIN   = D16;
static constexpr uint8_t BTN_A_PIN     = D19;

// ========================= Colors =========================

static constexpr uint16_t C_BLACK   = TFT_BLACK;
static constexpr uint16_t C_WHITE   = TFT_WHITE;
static constexpr uint16_t C_GREEN   = TFT_GREEN;     // was RGB565_LIGHTGREEN -> TFT_GREEN
static constexpr uint16_t C_RED     = TFT_RED;
static constexpr uint16_t C_CYAN    = TFT_CYAN;
static constexpr uint16_t C_YELLOW  = TFT_YELLOW;
static constexpr uint16_t C_GRAY    = 0x8410;
static constexpr uint16_t C_ORANGE  = 0xFD20;
static constexpr uint16_t C_DIM     = 0x2104;
static constexpr uint16_t C_PANEL   = 0x0841;
static constexpr uint16_t C_LINE    = 0x39E7;
static constexpr uint16_t C_ACCENT  = 0x04FF;
static constexpr uint16_t C_PANEL_2 = 0x1082;

// ========================= I2S object =========================

#if ESP_IDF_VERSION_MAJOR >= 5
static i2s_chan_handle_t g_i2sRxChan = nullptr;
#else
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;
#endif

