Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
// ========================= State =========================

struct Row { int y; };
static constexpr Row ROW_SD    {64};
static constexpr Row ROW_TOUCH {82};
static constexpr Row ROW_ACC   {122};
static constexpr Row ROW_GYR   {140};
static constexpr Row ROW_MIC_L {170};
static constexpr Row ROW_MIC_V {214};
static constexpr Row ROW_BTN1  {250};
static constexpr Row ROW_BTN2  {266};
static constexpr Row ROW_HINT  {282};
static constexpr Row ROW_TICK  {294};

static constexpr int VU_X = 14;
static constexpr int VU_Y = 190;
static constexpr int VU_W = 144;
static constexpr int VU_H = 18;
static constexpr int VU_SEG_COUNT = 12;
static constexpr int VU_GAP = 2;
static constexpr int VU_SEG_W = (VU_W - (VU_SEG_COUNT - 1) * VU_GAP) / VU_SEG_COUNT;

bool g_lcdOk = false;

bool g_sdMounted = false;
bool g_sdSessionOpen = false;
uint32_t g_sdOkFreq = 0;
uint64_t g_sdCardSizeMB = 0;
bool g_sdProbeDone = false;

// Async SD probe state. Full SD.begin() is done in a background task so the
// dashboard loop does not block and the LCD stays smooth.
volatile bool g_sdProbeBusy = false;
volatile bool g_sdProbeRequest = false;
volatile bool g_sdProbeResultReady = false;
volatile bool g_sdProbePresentResult = false;
volatile uint32_t g_sdProbeFreqResult = 0;
volatile uint32_t g_sdProbeSizeMbResult = 0;
uint8_t g_sdInsertStable = 0;
uint8_t g_sdRemoveStable = 0;

enum ImuType { IMU_NONE = 0, IMU_QMI8658, IMU_LSM6DS3 };
ImuType g_imuType = IMU_NONE;
uint8_t g_imuAddr = 0;
bool g_imuOk = false;
float g_ax = 0, g_ay = 0, g_az = 0;
float g_gx = 0, g_gy = 0, g_gz = 0;

bool g_touchFound = false;
uint8_t g_touchAddr = 0;
bool g_touchValid = false;
int g_touchX = -1;
int g_touchY = -1;
int g_touchRawX = -1;
int g_touchRawY = -1;
int g_touchIntRaw = HIGH;
uint8_t g_touchRawBytes[8] = {0};
uint32_t g_touchLastSeenMs = 0;
int g_touchLastX = -1;
int g_touchLastY = -1;

bool g_btnA = false;
bool g_btnB = false;
int g_btnARaw = HIGH;
int g_btnBRaw = HIGH;

bool g_micOk = false;
uint16_t g_micPeak = 0;
uint32_t g_micRms = 0;
uint32_t g_micLastUpdateMs = 0;
int16_t g_pdmBuf[MIC_SAMPLES_PER_READ];

uint32_t g_lastFastUiMs = 0;
uint32_t g_lastSlowUiMs = 0;
uint32_t g_lastVuMs = 0;
uint32_t g_lastMicTextMs = 0;
uint32_t g_lastSerialMs = 0;
uint32_t g_lastSdMs = 0;
uint32_t g_lastFooterMs = 0;

String cache_sd = "";
String cache_touch = "";
String cache_acc = "";
String cache_gyr = "";
String cache_btn1 = "";
String cache_btn2 = "";
String cache_mic = "";
String cache_footer = "";
String cache_tick = "";

float g_vuSmooth = 0.0f;
int cache_vuSegments = -1;
uint32_t g_frameCounter = 0;

// LCD/SD share the same physical SPI pins. The SD probe runs in a background task.
// These flags prevent the background task from touching the bus while a LCD draw is
// in progress, and prevent UI cache updates when a draw is skipped.
volatile bool g_lcdBusy = false;

// ========================= Logging =========================

static void logf(const char *fmt, ...) {
  char buf[256];
  va_list args;
  va_start(args, fmt);
  vsnprintf(buf, sizeof(buf), fmt, args);
  va_end(args);
  Serial.print(buf);
}

// ========================= Helpers =========================

static String padRight(const String &s, int width) {
  String out = s;
  while ((int)out.length() < width) out += ' ';
  if ((int)out.length() > width) out = out.substring(0, width);
  return out;
}

// Seeed_GFX drives the LCD over the shared hardware SPI host (Bus_SPI), which owns
// the SCK/MOSI/DC/CS pin routing. The original sketch bit-banged the LCD with a
// software-SPI bus and had to force D8/D10/D3/D2 back to GPIO mode after SD.begin()
// re-attached them to the ESP32 SPI peripheral. That recovery is now obsolete and
// would actively corrupt the hardware-SPI pin matrix, so this is a no-op. Kept as
// a stub so the call sites in beginLcdOp/acquireForLcd/closeSdSessionAndRestoreLcd
// remain structurally identical to the source.
static void restoreLcdSwSpiPins() {
}

static bool beginLcdOp() {
  if (g_sdProbeBusy) return false;

  g_lcdBusy = true;

  // Race guard: SD task may have started after the first check.
  if (g_sdProbeBusy) {
    g_lcdBusy = false;
    return false;
  }

  // Bus_SPI owns LCD_CS and parks it HIGH; only deselect SD here (shared FSPI bus).
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  restoreLcdSwSpiPins();
  delayMicroseconds(2);
  return true;
}

static void endLcdOp() {
  // Bus_SPI::endWrite already parked LCD_CS HIGH; just release the busy flag.
  g_lcdBusy = false;
}

static bool lcdBusAvailable() {
  return !g_sdProbeBusy;
}

static void acquireForLcd() {
  // Bus_SPI owns LCD_CS (D2) and parks it HIGH between transactions; only SD_CS
  // is idled here to keep the SD card off the shared FSPI bus before an LCD op.
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  restoreLcdSwSpiPins();
  delayMicroseconds(2);
}

static void acquireForSd() {
  // Bus_SPI parks LCD_CS HIGH after each LCD transaction; only SD_CS needs idling.
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  delayMicroseconds(2);
}

static int16_t le16(const uint8_t *p) {
  return (int16_t)((uint16_t)p[0] | ((uint16_t)p[1] << 8));
}

static bool i2cWrite8(uint8_t addr, uint8_t reg, uint8_t val) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission() == 0;
}

static bool i2cRead(uint8_t addr, uint8_t reg, uint8_t *buf, size_t len) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;

  size_t got = Wire.requestFrom((int)addr, (int)len);
  if (got != len) return false;

  for (size_t i = 0; i < len; i++) {
    buf[i] = Wire.read();
  }
  return true;
}

static bool i2cRead8(uint8_t addr, uint8_t reg, uint8_t *val) {
  return i2cRead(addr, reg, val, 1);
}

static bool i2cRawRead(uint8_t addr, uint8_t *buf, size_t len) {
  size_t got = Wire.requestFrom((int)addr, (int)len);
  if (got != len) return false;

  for (size_t i = 0; i < len; i++) {
    buf[i] = Wire.read();
  }
  return true;
}

static void scanI2c() {
  Serial.print("[I2C] scan:");
  int count = 0;
  for (uint8_t a = 1; a < 127; a++) {
    Wire.beginTransmission(a);
    if (Wire.endTransmission() == 0) {
      Serial.printf(" 0x%02X", a);
      count++;
    }
  }
  if (!count) Serial.print(" none");
  Serial.println();
}

