Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
// ========================= LCD =========================

static bool initLcd() {
  if (!display.begin<
          Board_DashBoard_147_ESP32,
          Config_Seeed_1inch47_Touch_JD9853A>()) {
    Serial.println("[LCD] display.begin() failed");
    Serial.println(display.lastResult().message);
    g_lcdOk = false;
    return false;
  }

  acquireForLcd();
  display.fillScreen(C_BLACK);

  g_lcdOk = true;
  Serial.println("[LCD] OK");
  return true;
}

static bool printTextFixed(int x, int y, uint16_t color, const String &text, int widthChars) {
  if (!beginLcdOp()) return false;
  display.setCursor(x, y);
  display.setTextSize(1);
  display.setTextColor(color, C_BLACK);
  display.print(padRight(text, widthChars));
  endLcdOp();
  return true;
}

static void drawVuFrame() {
  if (!beginLcdOp()) return;
  display.drawRoundRect(VU_X, VU_Y, VU_W, VU_H, 4, C_LINE);
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 1 + i * (VU_SEG_W + VU_GAP);
    display.fillRect(x, VU_Y + 1, VU_SEG_W, VU_H - 2, C_BLACK);
  }
  endLcdOp();
}

static void drawStaticLayout() {
  if (!beginLcdOp()) return;
  display.fillScreen(C_BLACK);

  // Premium dashboard UI:
  // keep "Hello,XIAO!" as the hero title, then group data into compact cards.
  display.setTextSize(2);
  display.setTextColor(C_GREEN, C_BLACK);
  display.setCursor(8, 5);
  display.print("Hello,XIAO!");

  // Top subtitle kept simple and bright.
  display.setTextSize(1);
  display.setTextColor(C_CYAN, C_BLACK);
  display.setCursor(8, 28);
  display.print("1.47 Inch Touch Display");

  display.drawFastHLine(8, 44, 156, C_LINE);

  // SYSTEM card
  display.drawRoundRect(6, 50, 160, 48, 6, C_CYAN);
  display.fillRect(10, 57, 3, 34, C_CYAN);
  display.setTextColor(C_CYAN, C_BLACK);
  display.setCursor(18, 54);
  display.print("SYSTEM");
  display.setTextColor(C_WHITE, C_BLACK);
  display.setCursor(18, ROW_SD.y);    display.print("SD");
  display.setCursor(18, ROW_TOUCH.y); display.print("Touch");

  // MOTION card
  display.drawRoundRect(6, 102, 160, 50, 6, C_YELLOW);
  display.fillRect(10, 112, 3, 32, C_YELLOW);
  display.setTextColor(C_YELLOW, C_BLACK);
  display.setCursor(18, 108);
  display.print("MOTION");
  display.setTextColor(C_WHITE, C_BLACK);
  display.setCursor(18, ROW_ACC.y); display.print("Acc");
  display.setCursor(18, ROW_GYR.y); display.print("Gyr");

  // AUDIO card
  display.drawRoundRect(6, 158, 160, 70, 6, C_GREEN);
  display.fillRect(10, 168, 3, 52, C_GREEN);
  display.setTextColor(C_GREEN, C_BLACK);
  display.setCursor(18, ROW_MIC_L.y);
  display.print("MIC LEVEL");

  // BUTTON card
  display.drawRoundRect(6, 236, 160, 42, 6, C_ACCENT);
  display.fillRect(10, 244, 3, 26, C_ACCENT);
  display.setTextColor(C_ACCENT, C_BLACK);
  display.setCursor(18, 240);
  display.print("BUTTON");
  display.setTextColor(C_WHITE, C_BLACK);
  display.setCursor(18, ROW_BTN1.y); display.print("USR1");
  display.setCursor(18, ROW_BTN2.y); display.print("USR2");

  display.setTextColor(C_CYAN, C_BLACK);
  display.setCursor(8, ROW_HINT.y); display.print("Serial synced output");

  // Lower footer product line: split into two compact lines so it is readable.
  display.setTextColor(C_WHITE, C_BLACK);
  display.setCursor(8, ROW_TICK.y); display.print("Powered by XIAO");

  display.setTextColor(C_YELLOW, C_BLACK);
  display.setCursor(8, ROW_TICK.y + 12); display.print("ESP32-S3 Plus");

  endLcdOp();

  drawVuFrame();

  cache_sd = "";
  cache_touch = "";
  cache_acc = "";
  cache_gyr = "";
  cache_btn1 = "";
  cache_btn2 = "";
  cache_mic = "";
  cache_footer = "";
  cache_tick = "";
  cache_vuSegments = -1;
}

// ========================= SD =========================

static void closeSdSessionAndRestoreLcd() {
  SD.end();
  // NOTE: do NOT call SPI.end() here. Seeed_GFX drives the LCD over the same
  // default SPI host (Bus_SPI), which is created once during display.begin() and
  // is not re-initialized per transaction. Tearing it down here would leave the
  // LCD bus dead until the next reboot. SD.end() releases the card; the shared
  // SPI host stays alive for the LCD.

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  restoreLcdSwSpiPins();
}

static bool sdFullMountProbe(uint32_t &okFreq, uint32_t &cardSizeMb) {
  // Full mount probe with no file access.
  // This is reliable for insert/remove, but runs in a background task.
  okFreq = 0;
  cardSizeMb = 0;

  // Do not steal the shared bus in the middle of a LCD write.
  while (g_lcdBusy) {
    vTaskDelay(pdMS_TO_TICKS(1));
  }

  acquireForSd();
  sdSpi.begin(LCD_SCK_PIN, SD_MISO_PIN, LCD_MOSI_PIN, SD_CS_PIN);
  delay(3);

  const uint32_t freqs[] = {400000};
  for (uint8_t i = 0; i < sizeof(freqs) / sizeof(freqs[0]); i++) {
    if (SD.begin(SD_CS_PIN, sdSpi, freqs[i])) {
      okFreq = freqs[i];
      uint64_t mb = SD.cardSize() / (1024ULL * 1024ULL);
      if (mb == 0) mb = 1;
      if (mb > 0xFFFFFFFFUL) mb = 0xFFFFFFFFUL;
      cardSizeMb = (uint32_t)mb;

      closeSdSessionAndRestoreLcd();
      return true;
    }

    SD.end();
    restoreLcdSwSpiPins();
    delay(2);
  }

  closeSdSessionAndRestoreLcd();
  return false;
}

static void sdProbeTask(void *param) {
  (void)param;

  for (;;) {
    if (g_sdProbeRequest && !g_sdProbeBusy) {
      g_sdProbeRequest = false;
      g_sdProbeBusy = true;

      uint32_t freq = 0;
      uint32_t sizeMb = 0;
      bool present = sdFullMountProbe(freq, sizeMb);

      g_sdProbePresentResult = present;
      g_sdProbeFreqResult = freq;
      g_sdProbeSizeMbResult = sizeMb;
      g_sdProbeResultReady = true;

      g_sdProbeBusy = false;
    }

    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

static void startSdProbeTask() {
  static bool started = false;
  if (started) return;
  started = true;

  xTaskCreatePinnedToCore(
    sdProbeTask,
    "sd_probe",
    4096,
    nullptr,
    1,
    nullptr,
    0
  );
}

static void requestSdProbe() {
  if (g_sdProbeBusy || g_sdProbeRequest) return;
  g_sdProbeRequest = true;
}

static void consumeSdProbeResult() {
  if (!g_sdProbeResultReady) return;

  bool present = g_sdProbePresentResult;
  uint32_t freq = g_sdProbeFreqResult;
  uint32_t sizeMb = g_sdProbeSizeMbResult;

