Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
  g_sdProbeResultReady = false;

  // Debounce:
  // - insert requires two positive probes.
  // - removal requires one negative probe for quick unplug response.
  if (present) {
    if (g_sdInsertStable < 3) g_sdInsertStable++;
    g_sdRemoveStable = 0;
  } else {
    if (g_sdRemoveStable < 3) g_sdRemoveStable++;
    g_sdInsertStable = 0;
  }

  bool oldState = g_sdMounted;

  if (present && g_sdInsertStable >= 2) {
    g_sdMounted = true;
    g_sdOkFreq = freq;
    g_sdCardSizeMB = sizeMb ? sizeMb : 1;
  }

  if (!present && g_sdRemoveStable >= 1) {
    g_sdMounted = false;
    g_sdOkFreq = 0;
    g_sdCardSizeMB = 0;
  }

  if (oldState != g_sdMounted) {
    cache_sd = "";  // force LCD row update immediately
  }

  Serial.printf("[SD] async result present=%u shown=%u freq=%lu size=%lluMB busy=%u\n",
                present ? 1 : 0,
                g_sdMounted ? 1 : 0,
                (unsigned long)g_sdOkFreq,
                g_sdCardSizeMB,
                g_sdProbeBusy ? 1 : 0);
}

static void updateSdStatus() {
  consumeSdProbeResult();
  requestSdProbe();
}

static void writeSdTestFileOnce() {
  // Dashboard mode: USR2 only requests an immediate async probe.
  requestSdProbe();
  Serial.println("[SD] async status refresh requested");
}

// ========================= Touch =========================

static bool i2cDevicePresent(uint8_t addr) {
  Wire.beginTransmission(addr);
  return Wire.endTransmission() == 0;
}

static void initTouch() {
  pinMode(TOUCH_INT_PIN, INPUT_PULLUP);

  if (!i2cDevicePresent(AXS5106L_I2C_ADDR)) {
    g_touchFound = false;
    g_touchAddr = 0;
    Serial.println("[TOUCH] AXS5106L not found at 0x63");
    return;
  }

  // display.begin() has already pulsed the shared LCD/touch RST line, so the touch
  // controller is initialized. Attach with rstPin=-1 to avoid resetting the LCD.
  if (!display.attachTouch(touch, display.panel().driver().bus())) {
    Serial.println("[TOUCH] attachTouch failed");
    Serial.println(display.lastResult().message);
    g_touchFound = false;
    return;
  }

  g_touchFound = true;
  g_touchAddr = AXS5106L_I2C_ADDR;
  g_touchValid = false;
  g_touchX = -1;
  g_touchY = -1;

  Serial.println("[TOUCH] AXS5106L OK at 0x63 (Seeed_GFX driver)");
}

static void updateTouch() {
  g_touchValid = false;
  g_touchX = -1;
  g_touchY = -1;
  g_touchRawX = -1;
  g_touchRawY = -1;
  g_touchIntRaw = digitalRead(TOUCH_INT_PIN);

  for (int i = 0; i < 8; i++) {
    g_touchRawBytes[i] = 0;
  }

  if (!g_touchFound) {
    return;
  }

  // Seeed_GFX Touch_AXS5106L reads register 0x01 and clamps coordinates to the
  // 172x320 panel range, replacing the old BSP bsp_touch_read/get_coordinates
  // path and the raw-I2C packet decoders.
  int32_t x = 0;
  int32_t y = 0;
  if (display.getTouch(&x, &y)) {
    g_touchX = (int)x;
    g_touchY = (int)y;
    g_touchRawX = (int)x;
    g_touchRawY = (int)y;

    g_touchLastX = g_touchX;
    g_touchLastY = g_touchY;
    g_touchLastSeenMs = millis();

    g_touchValid = true;
    return;
  }

  // The driver is interrupt-driven. Some touch panels only fire INT on down/move,
  // so keep the latest coordinate visible briefly instead of flickering immediately
  // back to release.
  if (g_touchLastSeenMs != 0 && (millis() - g_touchLastSeenMs) < 350) {
    g_touchX = g_touchLastX;
    g_touchY = g_touchLastY;
    g_touchRawX = g_touchLastX;
    g_touchRawY = g_touchLastY;
    g_touchValid = true;
    return;
  }
}

// ========================= IMU =========================

static bool initQmi(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x00, &who)) return false;
  if (who == 0x00 || who == 0xFF) return false;

  i2cWrite8(addr, 0x02, 0x60);
  i2cWrite8(addr, 0x03, 0x03);
  i2cWrite8(addr, 0x04, 0x53);
  i2cWrite8(addr, 0x08, 0x03);
  delay(20);

  uint8_t data[12] = {};
  if (!i2cRead(addr, 0x35, data, sizeof(data))) return false;

  g_imuType = IMU_QMI8658;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] QMI8658-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

static bool initLsm(uint8_t addr) {
  uint8_t who = 0;
  if (!i2cRead8(addr, 0x0F, &who)) return false;
  if (who != 0x69 && who != 0x6A && who != 0x6C) return false;

  i2cWrite8(addr, 0x10, 0x60);
  i2cWrite8(addr, 0x11, 0x60);
  delay(20);

  g_imuType = IMU_LSM6DS3;
  g_imuAddr = addr;
  g_imuOk = true;
  Serial.printf("[IMU] LSM6-compatible at 0x%02X, WHO=0x%02X\n", addr, who);
  return true;
}

static void initImu() {
  pinMode(IMU_INT_PIN, INPUT_PULLUP);

  g_imuType = IMU_NONE;
  g_imuOk = false;

  if (initQmi(0x6B)) return;
  if (initQmi(0x6A)) return;
  if (initLsm(0x6A)) return;
  if (initLsm(0x6B)) return;

  Serial.println("[IMU] not found");
}

static void updateImu() {
  if (g_imuType == IMU_QMI8658) {
    uint8_t d[12] = {};
    if (!i2cRead(g_imuAddr, 0x35, d, sizeof(d))) {
      g_imuOk = false;
      return;
    }

    g_ax = le16(&d[0]) / 16384.0f;
    g_ay = le16(&d[2]) / 16384.0f;
    g_az = le16(&d[4]) / 16384.0f;

    g_gx = le16(&d[6]) / 64.0f;
    g_gy = le16(&d[8]) / 64.0f;
    g_gz = le16(&d[10]) / 64.0f;

    g_imuOk = true;
  } else if (g_imuType == IMU_LSM6DS3) {
    uint8_t g[6] = {};
    uint8_t a[6] = {};

    if (!i2cRead(g_imuAddr, 0x22, g, sizeof(g)) ||
        !i2cRead(g_imuAddr, 0x28, a, sizeof(a))) {
      g_imuOk = false;
      return;
    }

    g_gx = le16(&g[0]) * 0.00875f;
    g_gy = le16(&g[2]) * 0.00875f;
    g_gz = le16(&g[4]) * 0.00875f;

    g_ax = le16(&a[0]) * 0.000061f;
    g_ay = le16(&a[2]) * 0.000061f;
    g_az = le16(&a[4]) * 0.000061f;

    g_imuOk = true;
  } else {
    g_imuOk = false;
  }
}

// ========================= Buttons =========================

static void updateButtons() {
  g_btnARaw = digitalRead(BTN_A_PIN);
  g_btnBRaw = digitalRead(BTN_B_PIN);
  g_btnA = (g_btnARaw == LOW);
  g_btnB = (g_btnBRaw == LOW);
}

// ========================= MIC =========================

static void deinitMic() {
#if ESP_IDF_VERSION_MAJOR >= 5
  if (g_i2sRxChan) {
    i2s_channel_disable(g_i2sRxChan);
    i2s_del_channel(g_i2sRxChan);
    g_i2sRxChan = nullptr;
  }
#else
  i2s_driver_uninstall(I2S_PORT);
#endif
  g_micOk = false;
}

static bool initMic() {
  deinitMic();

