Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
#if ESP_IDF_VERSION_MAJOR >= 5
  i2s_chan_config_t chanCfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  chanCfg.dma_desc_num = 4;
  chanCfg.dma_frame_num = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_new_channel(&chanCfg, nullptr, &g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_new_channel failed: %d\n", (int)err);
    return false;
  }

  i2s_pdm_rx_config_t pdmCfg = {};
  pdmCfg.clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(MIC_SAMPLE_RATE_HZ);
  pdmCfg.slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO);
  pdmCfg.gpio_cfg.clk = (gpio_num_t)MIC_CLK_PIN;
  pdmCfg.gpio_cfg.din = (gpio_num_t)MIC_DATA_PIN;
  pdmCfg.gpio_cfg.invert_flags.clk_inv = MIC_CLK_INVERT;

  err = i2s_channel_init_pdm_rx_mode(g_i2sRxChan, &pdmCfg);
  if (err != ESP_OK) {
    Serial.printf("[MIC] init_pdm failed: %d\n", (int)err);
    deinitMic();
    return false;
  }

#if REDUCE_PDM_CLK_DRIVE
  gpio_set_drive_capability((gpio_num_t)MIC_CLK_PIN, GPIO_DRIVE_CAP_0);
#endif

  err = i2s_channel_enable(g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] enable failed: %d\n", (int)err);
    deinitMic();
    return false;
  }
#else
  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
  cfg.sample_rate = MIC_SAMPLE_RATE_HZ;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  cfg.communication_format = I2S_COMM_FORMAT_I2S;
  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 4;
  cfg.dma_buf_len = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_driver_install(I2S_PORT, &cfg, 0, nullptr);
  if (err != ESP_OK) return false;

  i2s_pin_config_t pins = {};
  pins.bck_io_num = I2S_PIN_NO_CHANGE;
  pins.ws_io_num = MIC_CLK_PIN;
  pins.data_out_num = I2S_PIN_NO_CHANGE;
  pins.data_in_num = MIC_DATA_PIN;
  if (i2s_set_pin(I2S_PORT, &pins) != ESP_OK) return false;
#endif

  g_micOk = true;
  Serial.println("[MIC] OK");
  return true;
}

static bool readMic(size_t *bytesRead, uint32_t timeoutMs) {
  *bytesRead = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
  if (!g_i2sRxChan) return false;
  esp_err_t err = i2s_channel_read(g_i2sRxChan, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#else
  esp_err_t err = i2s_read(I2S_PORT, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#endif

  return (err == ESP_OK && *bytesRead > 0);
}

static void updateMicPeak() {
  if (!g_micOk) return;

  size_t bytesRead = 0;
  if (!readMic(&bytesRead, 2)) {
    return;
  }

  int samples = bytesRead / sizeof(int16_t);
  if (samples <= 0) return;

  int64_t sum = 0;
  for (int i = 0; i < samples; ++i) {
    sum += g_pdmBuf[i];
  }
  int32_t mean = (int32_t)(sum / samples);

  uint32_t peak = 0;
  uint64_t sq = 0;
  for (int i = 0; i < samples; ++i) {
    int32_t v = (int32_t)g_pdmBuf[i] - mean;
    uint32_t a = (v < 0) ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * (uint64_t)a;
  }

  g_micPeak = (uint16_t)((peak > 65535) ? 65535 : peak);
  g_micRms = (uint32_t)sqrt((double)sq / samples);
  g_micLastUpdateMs = millis();
}

static uint16_t currentMicPeak() {
  uint32_t now = millis();
  if (now - g_micLastUpdateMs > MIC_DECAY_MS) {
    g_micPeak = (uint16_t)(g_micPeak * 0.75f);
    g_micRms = (uint32_t)(g_micRms * 0.75f);
  }
  return g_micPeak;
}

static uint16_t vuColorForIndex(int idx) {
  if (idx >= 10) return C_RED;
  if (idx >= 7) return C_ORANGE;
  return C_GREEN;
}

// ========================= UI updates =========================

static void updateVuMeter() {
  uint16_t micPeak = currentMicPeak();

  float target = (float)micPeak / MIC_DISPLAY_SCALE;
  if (target < 0.0f) target = 0.0f;
  if (target > 1.0f) target = 1.0f;

  // attack faster, release slower
  if (target > g_vuSmooth) g_vuSmooth = g_vuSmooth * 0.55f + target * 0.45f;
  else g_vuSmooth = g_vuSmooth * 0.86f + target * 0.14f;

  int activeSegs = (int)roundf(g_vuSmooth * VU_SEG_COUNT);
  if (activeSegs < 0) activeSegs = 0;
  if (activeSegs > VU_SEG_COUNT) activeSegs = VU_SEG_COUNT;

  if (activeSegs == cache_vuSegments) return;

  if (!beginLcdOp()) return;
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 1 + i * (VU_SEG_W + VU_GAP);
    uint16_t color = (i < activeSegs) ? vuColorForIndex(i) : C_BLACK;
    display.fillRect(x, VU_Y + 1, VU_SEG_W, VU_H - 2, color);
  }
  endLcdOp();

  cache_vuSegments = activeSegs;
}

static void updateMicText() {
  uint16_t micPeak = currentMicPeak();
  String micText = String("Raw ") + String((unsigned)micPeak);
  if (micText != cache_mic) {
    if (printTextFixed(18, ROW_MIC_V.y, C_WHITE, micText, 18)) {
      cache_mic = micText;
    }
  }
}

static void updateUiFast() {
  String sdText;
  if (g_sdMounted) {
    sdText = String("OK  ") + String(g_sdOkFreq / 1000) + "k";
  } else {
    sdText = "NO CARD";
  }

  if (sdText != cache_sd) {
    if (printTextFixed(52, ROW_SD.y, g_sdMounted ? C_GREEN : C_RED, sdText, 14)) {
      cache_sd = sdText;
    }
  }

  String touchText;
  if (!g_touchFound) {
    touchText = "not found";
  } else if (g_touchValid) {
    touchText = String(g_touchX) + "," + g_touchY;
  } else {
    touchText = "release";
  }

  if (touchText != cache_touch) {
    if (printTextFixed(66, ROW_TOUCH.y, g_touchFound ? C_CYAN : C_RED, touchText, 12)) {
      cache_touch = touchText;
    }
  }

  String btn1Text = g_btnA ? "Pressed " : "Released";
  if (btn1Text != cache_btn1) {
    if (printTextFixed(62, ROW_BTN1.y, g_btnA ? C_GREEN : C_WHITE, btn1Text, 11)) {
      cache_btn1 = btn1Text;
    }
  }

  String btn2Text = g_btnB ? "Pressed " : "Released";
  if (btn2Text != cache_btn2) {
    if (printTextFixed(62, ROW_BTN2.y, g_btnB ? C_GREEN : C_WHITE, btn2Text, 11)) {
      cache_btn2 = btn2Text;
    }
  }
}

static void updateUiSlow() {
  char buf[64];

  String accText;
  if (g_imuOk) {
    snprintf(buf, sizeof(buf), "%.1f %.1f %.1f", g_ax, g_ay, g_az);
    accText = String(buf);
  } else {
    accText = "not found";
  }

  if (accText != cache_acc) {
    if (printTextFixed(52, ROW_ACC.y, g_imuOk ? C_WHITE : C_RED, accText, 14)) {
      cache_acc = accText;
    }
  }

