Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.47 inch Touch Display/ESP32-S3 Plus/0519_DashBoard_147_ESP32/0519_DashBoard_147_ESP32.ino
  String gyrText;
  if (g_imuOk) {
    snprintf(buf, sizeof(buf), "%.1f %.1f %.1f", g_gx, g_gy, g_gz);
    gyrText = String(buf);
  } else {
    gyrText = "not found";
  }

  if (gyrText != cache_gyr) {
    if (printTextFixed(52, ROW_GYR.y, g_imuOk ? C_WHITE : C_RED, gyrText, 14)) {
      cache_gyr = gyrText;
    }
  }
}

static void updateFooter() {
  // Footer is static in v6.6:
  // - "Serial synced output"
  // - "Powered by XIAO"
  // - "ESP32-S3 Plus"
}

static void printSerialStatus() {
  logf("[DASH] sd=%s freq=%lu size=%lluMB touch=%s x=%d y=%d imu=%s type=%d "
       "acc=(%.2f,%.2f,%.2f) gyr=(%.2f,%.2f,%.2f) micPeak=%u micRms=%lu "
       "usr1=%s raw1=%d usr2=%s raw2=%d tick=%lu touchAddr=0x%02X int=%d rawTouch=(%d,%d)\n",
       g_sdMounted ? "Inserted" : "Unplugged",
       (unsigned long)g_sdOkFreq,
       g_sdCardSizeMB,
       g_touchValid ? "Y" : "N",
       g_touchX, g_touchY,
       g_imuOk ? "OK" : "NO",
       (int)g_imuType,
       g_ax, g_ay, g_az,
       g_gx, g_gy, g_gz,
       (unsigned)currentMicPeak(),
       (unsigned long)g_micRms,
       g_btnA ? "Pressed" : "Released", g_btnARaw,
       g_btnB ? "Pressed" : "Released", g_btnBRaw,
       (unsigned long)g_frameCounter,
       g_touchAddr,
       g_touchIntRaw,
       g_touchRawX, g_touchRawY);
}

// ========================= Setup / loop =========================

static void printHeader() {
  Serial.println();
  Serial.println("=== XIAO ESP32-S3 Plus Factory Dynamic Dashboard v6.6 (Seeed_GFX) ===");
  Serial.println("dynamic raw-SD detect + AXS5106L touch coords (Seeed_GFX Touch_AXS5106L)");
  Serial.printf("LCD: Seeed_GFX Bus_SPI, CS=D2(%d), DC=D3(%d), SCK=D8(%d), MOSI=D10(%d), RST=%d, BL=%d\n",
                LCD_CS_PIN, LCD_DC_PIN, LCD_SCK_PIN, LCD_MOSI_PIN, LCD_RST_PIN, LCD_BL_PIN);
  Serial.printf("MIC: CLK=D0(%d), DATA=D1(%d), sample=%d\n", MIC_CLK_PIN, MIC_DATA_PIN, MIC_SAMPLE_RATE_HZ);
  Serial.printf("SD : CS=D6(%d), SCK=D8(%d), MISO=D9(%d), MOSI=D10(%d)\n", SD_CS_PIN, LCD_SCK_PIN, SD_MISO_PIN, LCD_MOSI_PIN);
  Serial.printf("I2C: SDA=D4(%d), SCL=D5(%d), TOUCH_INT=D7(%d), IMU_INT=D14(%d)\n", I2C_SDA_PIN, I2C_SCL_PIN, TOUCH_INT_PIN, IMU_INT_PIN);
  Serial.printf("BTN: USR1=%d, USR2=%d\n", BTN_A_PIN, BTN_B_PIN);
  Serial.println("TOUCH: Seeed_GFX Touch_AXS5106L (I2C 0x63) via display.attachTouch()");
  Serial.println("SD: async full-mount probe task with LCD bus guard");
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  // Avoid flooding serial with ESP-IDF I2C NACK diagnostics while probing touch.
  // We still report touch status in our own [DASH] line.
  esp_log_level_set("i2c.master", ESP_LOG_NONE);

  WiFi.mode(WIFI_OFF);
  WiFi.disconnect(true);

  printHeader();

  pinMode(BTN_A_PIN, INPUT_PULLUP);
  pinMode(BTN_B_PIN, INPUT_PULLUP);
  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);

  scanI2c();

  initImu();

  if (!initLcd()) {
    Serial.println("[FAIL] LCD init failed");
    return;
  }

  // attachTouch must run after display.begin() has pulsed the shared LCD/touch RST.
  initTouch();

  drawStaticLayout();

  if (!initMic()) {
    Serial.println("[WARN] MIC init failed, VU may stay zero");
  }

  startSdProbeTask();
  Serial.println("[SD] async probe task started");
  requestSdProbe();

  updateTouch();
  updateImu();
  updateButtons();
  updateMicPeak();

  // Keep the base UI already drawn above; do not redraw it while the first SD
  // background probe might be using the bus.
  updateUiFast();
  updateUiSlow();
  updateVuMeter();
  updateMicText();
  updateFooter();
  printSerialStatus();

  Serial.println("[BOOT] dynamic dashboard v6.6 ready");
}

void loop() {
  uint32_t now = millis();

  // Update raw states as often as possible.
  updateMicPeak();

  // Full SD.begin() probe runs in a background task.
  // Main loop only consumes results and requests the next probe, so the UI stays smooth.
  consumeSdProbeResult();
  if (now - g_lastSdMs >= SD_REFRESH_MS) {
    g_lastSdMs = now;
    requestSdProbe();
  }

  if (now - g_lastSlowUiMs >= UI_TEXT_SLOW_MS) {
    g_lastSlowUiMs = now;
    updateImu();
    updateTouch();
    updateButtons();
    updateUiSlow();
  }

  if (now - g_lastFastUiMs >= UI_TEXT_FAST_MS) {
    g_lastFastUiMs = now;
    updateUiFast();
  }

  if (now - g_lastVuMs >= UI_VU_MS) {
    g_lastVuMs = now;
    updateVuMeter();
  }

  if (now - g_lastMicTextMs >= UI_MIC_TEXT_MS) {
    g_lastMicTextMs = now;
    updateMicText();
  }

  if (now - g_lastFooterMs >= FOOTER_MS) {
    g_lastFooterMs = now;
    updateFooter();
  }

  if (now - g_lastSerialMs >= SERIAL_MS) {
    g_lastSerialMs = now;
    printSerialStatus();
  }

  delay(1);
}
